{"backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"config": {"name": "dense_1", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 12, "trainable": true, "kernel_regularizer": null, "use_bias": true, "batch_input_shape": [null, 12], "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "relu", "dtype": "float32", "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_2", "bias_constraint": null, "units": 10, "trainable": true, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "relu", "dtype": "float32", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_3", "bias_constraint": null, "units": 6, "trainable": true, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "linear", "dtype": "float32", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Dense"}]}, "class_name": "Sequential", "keras_version": "2.3.1"}